In [1]:
import pandas as pd

### Important Data structures in Pandas
* Series
* DataFrame

In [3]:
ser = pd.Series(data=[1,2,3,4], index=['a','b','c','d'])

In [4]:
type(ser)

pandas.core.series.Series

In [6]:
ser['a']

1

In [7]:
ser.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [8]:
ser.values

array([1, 2, 3, 4], dtype=int64)

In [9]:
ser2 = pd.Series(data=[11,12,13,44], index=['a','b','c','d'])

In [11]:
df = pd.DataFrame(data={
    'infoa':ser,
    'infob':ser2
})

In [12]:
df

   infoa  infob
a      1     11
b      2     12
c      3     13
d      4     44

In [13]:
ser3 = pd.Series(data=[11,52,53,54], index=['a','b','c','e'])

In [15]:
pd.DataFrame(data={
    'a':ser,
    'b':ser3
})

     a     b
a  1.0  11.0
b  2.0  52.0
c  3.0  53.0
d  4.0   NaN
e  NaN  54.0

In [16]:
import numpy as np

In [19]:
data = list(zip(np.arange(10),np.arange(10,20)))

In [22]:
numdf = pd.DataFrame(data=data, columns=['a','b'], index=['a','b','c','d','e','f','g','h','i','j'])

In [24]:
numdf.to_csv('num.csv')

In [26]:
births = pd.read_csv('births.csv')

In [27]:
births.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15547 entries, 0 to 15546
Data columns (total 5 columns):
year      15547 non-null int64
month     15547 non-null int64
day       15547 non-null object
gender    15547 non-null object
births    15547 non-null int64
dtypes: int64(3), object(2)
memory usage: 607.4+ KB

In [28]:
births.head()

   year  month day gender  births
0  1969      1   1      F    4046
1  1969      1   1      M    4440
2  1969      1   2      F    4454
3  1969      1   2      M    4548
4  1969      1   3      F    4548

In [30]:
np.max(births.births)

199622

In [31]:
births['births'].max()

199622

In [32]:
births[births.births == births['births'].max()]

       year  month   day gender  births
15514  2007      8  null      M  199622

In [34]:
births[births['gender'] == 'M']

       year  month   day gender  births
1      1969      1     1      M    4440
3      1969      1     2      M    4548
5      1969      1     3      M    4994
7      1969      1     4      M    4520
9      1969      1     5      M    4198
11     1969      1     6      M    4850
13     1969      1     7      M    5092
15     1969      1     8      M    4934
17     1969      1     9      M    4842
19     1969      1    10      M    5190
21     1969      1    11      M    4598
23     1969      1    12      M    4324
25     1969      1    13      M    5076
27     1969      1    14      M    5296
29     1969      1    15      M    5096
31     1969      1    16      M    4872
33     1969      1    17      M    5030
35     1969      1    18      M    4642
37     1969      1    19      M    4452
39     1969      1    20      M    4924
41     1969      1    21      M    5432
43     1969      1    22      M    5088
45     1969      1    23      M    4660
47     1969      1    24      M    5046
49     1969      1    25      M    4674
51     1969      1    26      M    4338
53     1969      1    27      M    5046
55     1969      1    28      M    5172
57     1969      1    29      M    4880
59     1969      1    30      M    5006
...     ...    ...   ...    ...     ...
15488  2006      7  null      M  189126
15490  2006      8  null      M  198942
15492  2006      9  null      M  191866
15494  2006     10  null      M  188122
15496  2006     11  null      M  180670
15498  2006     12  null      M  182459
15500  2007      1  null      M  181789
15502  2007      2  null      M  167507
15504  2007      3  null      M  184984
15506  2007      4  null      M  173674
15508  2007      5  null      M  186016
15510  2007      6  null      M  184468
15512  2007      7  null      M  195135
15514  2007      8  null      M  199622
15516  2007      9  null      M  187526
15518  2007     10  null      M  189157
15520  2007     11  null      M  180814
15522  2007     12  null      M  181426
15524  2008      1  null      M  182789
15526  2008      2  null      M  173434
15528  2008      3  null      M  179129
15530  2008      4  null      M  177399
15532  2008      5  null      M  182294
15534  2008      6  null      M  179267
15536  2008      7  null      M  192714
15538  2008      8  null      M  191315
15540  2008      9  null      M  188964
15542  2008     10  null      M  183219
15544  2008     11  null      M  165468
15546  2008     12  null      M  181235

[7771 rows x 5 columns]

In [36]:
len(births[births['month'] == 1])

1306

In [38]:
births[births.day != 'null'].births.max()

6527

In [43]:
births1969Jan = births[(births.month == 1) & (births.year == 1969)]

In [45]:
np.sum(births1969Jan.births)

293940

### Find the month when most babies are born

In [47]:
birth_info = []
for i in range(1,13):
    df = births[(births.month == i)]
    birth_info.append((i,np.sum(df.births)))

In [50]:
sorted(birth_info,key=lambda d:d[1],reverse=True)

[(8, 13528007),
 (7, 13367556),
 (9, 13252831),
 (10, 12954950),
 (3, 12678844),
 (12, 12656915),
 (5, 12624972),
 (6, 12521070),
 (1, 12364197),
 (11, 12197967),
 (4, 12085891),
 (2, 11541178)]